{
    "contact": {
        "name": [
            "Dênnis",
            "Sousa",
            "Dênnis Sousa"
        ],
        "cellphone": "+55 83 98650 8421",
        "email": "ddspog@gmail.com",
        "github": "ddspog",
        "gitlab": "ddspog",
        "facebook": "ddspog",
        "address": {
            "EN": "117 Dr Francisco Lima Neto",
            "PT": "Rua Dr Francisco Lima Neto, 117"
        },
        "city": "Campina Grande",
        "state": "PB",
        "country": {
            "EN": "Brazil",
            "PT": "Brasil"
        },
        "about": {
            "EN": "A new developer that likes optimizing stuff, and researching about all new backend technologies.Works in data analysis and information systems.",
            "PT": "Um desenvolvedor que gosta de optimizar tudo, e pesquisar sobre as novas tendências em back-end. Trabalhos em análise de dados e sistemas de informação."
        }
    },
    "education": {
        "keyword-title": {
            "EN": "Education",
            "PT": "Formação"
        },
        "local": {
            "EN": "Campina Grande, Brazil",
            "PT": "Campina Grande, Brasil"
        },
        "university": {
            "EN": "UFCG",
            "PT": "UFCG"
        },
        "period": {
            "EN": "May 2013 --- Mar 2018",
            "PT": "Mai 2013 --- Mar 2018"
        },
        "major": {
            "EN": "Bachelor in Computer Science",
            "PT": "Bacharelado em Ciências da Computação"
        },
        "grade": {
            "EN": "GPA: 7.55/10.0",
            "PT": "CRA: 7.55/10.0"
        }
    },
    "employment": {
        "keyword-title": {
            "EN": "Employment",
            "PT": "Experiência"
        },
        "works-n": 3,
        "works-npone": 4,
        "works": [
            {
                "type": {
                    "EN": "PIBITI",
                    "PT": "PIBITI"
                },
                "employer": {
                    "EN": "CNPq",
                    "PT": "CNPq"
                },
                "period": {
                    "EN": "Nov 2013 --- Jul 2014",
                    "PT": "Nov 2013 --- Jul 2014"
                },
                "title": {
                    "EN": "Research on project `An approach to categorize nonconformances between Java code and JML contracts'",
                    "PT": "Pesquisador no projeto `Uma abordagem para a categorização de não-conformidades entre código Java e contratos JML'"
                },
                "info": {
                    "EN": "Work on development of a tool (JMLOK 2.0) to categorize nonconformances in Java\/JML contract-based programs. Learned and used Java Swing and AST for JML during the project.",
                    "PT": "Trabalhou no desenvolvimento de uma ferramenta (JMLOK 2.0) para categorizar não-conformidades em programas baseado em contratos em Java\/Jml. Aprendeu e utilizou Java Swing e AST para JML ao longo do projeto."
                }
            },
            {
                "type": {
                    "EN": "PIBIC",
                    "PT": "PIBIC"
                },
                "employer": {
                    "EN": "CNPq",
                    "PT": "CNPq"
                },
                "period": {
                    "EN": "Aug 2014 --- Jul 2015",
                    "PT": "Ago 2014 --- Jul 2015"
                },
                "title": {
                    "EN": "Research on project `An approach to categorize nonconformances on contract-based programs'",
                    "PT": "Pesquisador no projeto `Uma abordagem para a categorização de não-conformidades em programas baseados em contratos'"
                },
                "info": {
                    "EN": "Wrote a implementation of JMLOK 2.0 tool as a new tool (ContractOk), for categorization of C\\#/CodeContracts contract-based programs. A static analysis module was created to enhance nonconformances correction. Used mainly C\\# Windows Form, .NET compiler platform ('Roslyn') for code analysis and Randoop for test generation. ",
                    "PT": "Escreveu uma implementação da ferramenta JMLOK 2.0 como uma nova ferramenta (ContractOK), para categorizar programas baseados em contratos escritos com C\\#/CodeContracts. Um módulo de análise estática foi desenvolvido para melhorar a correção de não-conformidades. Utilizou C\\# Windows Form, a plataforma .NET de compilação ('Roslyn') para análise de código e a ferramenta Randoop para geração automática de testes."
                }
            },
            {
                "type": {
                    "EN": "PIBIC",
                    "PT": "PIBIC"
                },
                "employer": {
                    "EN": "CNPq",
                    "PT": "CNPq"
                },
                "period": {
                    "EN": "Aug 2016-- - Jul 2017",
                    "PT": "Ago 2016 --- Jul 2017"
                },
                "title": {
                    "EN": "Research on project `Developing mobile applications as a tool for control and monitoring of sanitary conditions on Federal University of Campina Grande (UFCG)'",
                    "PT": "Pesquisador no projeto `O desenvolvimento de aplicativos móveis como ferramenta de apoio à identificação, monitoramento e controle de problemas nas condições sanitárias da Universidade Federal de Campina Grande (UFCG)'"
                },
                "info": {
                    "EN": "Created Inspetor Mups, an Android app for collecting data on sanitary problems on the Federal University of Campina Grande (UFCG) campus. App was produced using Meteor framework as back-end, with Javascript. App interface was created using Cordova with AngularJs as front-end, following Material Design guidelines.",
                    "PT": "Criou o aplicativo Inspetor Mups para Android, uma ferramenta para coletar registros de problemas sanitários na Universidade Federal de Campina Grande (UFCG). O aplicativo foi produzido utilizando a framework Meteor como back-end, usando Javascript. A interface do aplicativo foi feita utilizando Cordova com AngularJs como front-end, seguindo o padrão Material Design."
                }
            }
        ]
    },
    "skills": {
        "keyword-title": {
            "EN": "Skills",
            "PT": "Habilidades Técnicas"
        },
        "keyword-strong": {
            "EN": "Strong",
            "PT": "Principais"
        },
        "keyword-knowledgeable": {
            "EN": "Knowledgeable",
            "PT": "Experiente"
        },
        "strong": "Java, C\\#, Go, Python, ES6, Git, R, Angular, MongoDB",
        "knowledgeable": "SQL, Meteor, Cordova, Play, LESS, C++, C, TDD, BDD, Unity"
    }
}